# DataSet 2 :
### 200520109 : Prachiben Patel
## Quesiton 1: What value is displayed when the last expression (a) is evaluated? Explain your answer by indicating what happens in every executed statement.

In [4]:
a = 0
def b():
    global a
    a = c(a)
def c(a):
    return a + 2

In [5]:
b()
a

2

value of a was 0 after running the b function, it became 0 + 2 = 2.

In [6]:
b()
a

4

as a was 2 then after running again b(), it became 2 + 2 = 4.

In [7]:
b()
a

6

yes again a was 4, after b(), 4 + 2 = 6.

# Que 2 : Function fileLength(), given to you, takes the name of a file as input and returns the length of the file:

In [17]:
def file_Length(filename):
    try:
        infile = open (filename,'r')
        content = infile.read ()
        lenn = len(content)
        print (lenn)
        infile.close()
    except :
        print ("File " + format (filename) + "not found")

In [15]:
file_Length("demo.txt")

123

In [18]:
file_Length("notexist.txt")

File notexist.txtnot found

# Que 3: Write a class named Marsupial that can be used as shown below:

In [1]:
class Marsupial:
    def __init__(self):
        self.list = []

    def put_in_pouch (self, item):
        return self.list.append(item)

    def pouch_contents(self):
        return self.list

In [2]:
m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()

['doll', 'firetruck', 'kitten']

In [9]:
class Kangaroo (Marsupial):
    def __init__(s,a=0,b=0):
        s.list = []
        s.x = a
        s.y = b      
    def jump (s,x1,y1):
        s.x+=x1
        s.y+=y1      
    def __str__(s): 
        return ('I am a Kangaroo located at coordinates ({},{})'.format(s.x, s.y))

In [10]:
k = Kangaroo(0,0)
print(k)

I am a Kangaroo located at coordinates (0,0)

In [11]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()

['doll', 'firetruck', 'kitten']

In [12]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (3,0)

# Que 4: Write function collatz() that takes a positive integer x as input and prints the Collatz sequence starting at x. A Collatz sequence is obtained by repeatedly applying this rule to the previous number x in the sequence:

In [17]:
def collatz(x):
    print (x) 
    if (x%2 == 1):
        if (x != 1):
            x = int(3*x +1)
            collatz(x)
    else:
        x = int(x/2)
        collatz(x)

In [15]:
collatz(1)

1

In [18]:
collatz(10)

10
5
16
8
4
2
1

# Que 5 : Write a recursive method binary() that takes a non-negative integer n and prints the binary representation of integer n.

In [46]:
def binary(n):
    s = str(n % 2)

    if n >> 1 > 0:
        s += binary(n >> 1)
        s1 = int(s)
    return s

In [47]:
binary(1)

'1'

In [48]:
binary(3)

'11'

In [49]:
binary(9)

'1001'

# Que 6 : Implement a class named HeadingParser that can be used to parse an HTML document, and retrieve and print all the headings in the document. You should implement your class as a subclass of HTMLParser, defined in Standard Library module html.parser. When fed a string containing HTML code, your class should print the headings, one per line and in the order in which they appear in the document. Each heading should be indented as follows: an h1 heading should have indentation 0, and h2 heading should have indentation 1, etc. Test your implementation using w3c.html.

# Que 7 : Implement recursive function webdir() that takes as input: a URL (as a string) and non-negative integers depth and indent. Your function should visit every web page reachable from the starting URL web page in depth clicks or less, and print each web page's URL. As shown below, indentation, specified by indent, should be used to indicate the depth of a URL

In [51]:
from urllib.request import urlopen
from urllib.parse import urljoin
from html.parser import HTMLParser
class Collector(HTMLParser):
    

    def __init__(self, url):
        
        HTMLParser.__init__(self)
        self.url = url
        self.links = []

    
    def handle_starttag(self, tag, attrs):
        
        if tag == 'a':
            for attr in attrs:
                if attr[0] == 'href':
                    
                    absolute = urljoin(self.url, attr[1])
                    if absolute[:4] == 'http': # collect HTTP URLs
                        self.links.append(absolute)
                        
    def getLinks(self):
        
        return self.links

In [60]:
def webdir(url, depth, indent):
        for i in range(indent+1):
            print("\t",end='')
        print(url)
    
        
        content = urlopen(url).read().decode()
        collector = Collector(url)
        collector.feed(content)
        urls = collector.getLinks()
    
        for o in range(depth):
            try:                    
                webdir(urls[o], depth-1, indent+1)
            except:
                pass

In [61]:
webdir('http://reed.cs.depaul.edu/lperkovic/one.html',2,0)

	http://reed.cs.depaul.edu/lperkovic/one.html
		http://reed.cs.depaul.edu/lperkovic/two.html
			http://reed.cs.depaul.edu/lperkovic/four.html
		http://reed.cs.depaul.edu/lperkovic/three.html
			http://reed.cs.depaul.edu/lperkovic/four.html

In [63]:
## installation of sql
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (0.4.1)
Requirement already satisfied: prettytable<1 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: six in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython-sql) (1.4.37)
Requirement already satisfied: sqlparse in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: ipython>=1.0 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython-sql) (8.3.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: backcall in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.29)
Requirement already satisfied: traitlets>=5 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (5.2.1.post0)
Requirement already satisfied: stack-data in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: matplotlib-inline in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.3)
Requirement already satisfied: colorama in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: decorator in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (5.1.1)
Requirement already satisfied: pygments>=2.4.0 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (2.12.0)
Requirement already satisfied: jedi>=0.16 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (0.18.1)
Requirement already satisfied: pickleshare in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: setuptools>=18.5 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from ipython>=1.0->ipython-sql) (58.1.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.1.2)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.8.3)
Requirement already satisfied: wcwidth in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: asttokens in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.2.2)
Requirement already satisfied: executing in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from stack-data->ipython>=1.0->ipython-sql) (0.8.3)

In [64]:
!pip install pysqlite3

Collecting pysqlite3
  Using cached pysqlite3-0.4.7.tar.gz (40 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Using legacy 'setup.py install' for pysqlite3, since package 'wheel' is not installed.
Installing collected packages: pysqlite3
  Running setup.py install for pysqlite3: started
  Running setup.py install for pysqlite3: finished with status 'done'
Successfully installed pysqlite3

In [65]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.21.0 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from pandas) (1.22.4)
Requirement already satisfied: six>=1.5 in c:\users\prachiii\appdata\local\programs\python\python310\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

# Que 8 : Write SQL queries on the below database table that return:

In [66]:
import pandas as pd
import sqlite3

In [67]:
df = pd.DataFrame({'City':['Mumbai','Mumbai','Mumbai','Mumbai','London','London','London','London','Cairo','Cairo','Cairo','Cairo'],
                   'Country':['India','India','India','India','Uk','Uk','Uk','Uk','Egypt','Egypt','Egypt','Egypt'],
                   'Season':['Winter','Spring','Summer','Fall','Winter','Spring','Summer','Fall','Winter','Spring','Summer','Fall'],
                   'Temp_c':[24.8,28.4,27.9,27.6,4.2,8.3,15.7,10.4,13.6,20.7,27.7,22.2],
                   'rainF_mm':[5.9,16.2,1549.4,346.0,207.7,169.6,157.0,218.5,16.5,6.5,0.1,4.5]})
df

      City Country  Season  Temp_c  rainF_mm
0   Mumbai   India  Winter    24.8       5.9
1   Mumbai   India  Spring    28.4      16.2
2   Mumbai   India  Summer    27.9    1549.4
3   Mumbai   India    Fall    27.6     346.0
4   London      Uk  Winter     4.2     207.7
5   London      Uk  Spring     8.3     169.6
6   London      Uk  Summer    15.7     157.0
7   London      Uk    Fall    10.4     218.5
8    Cairo   Egypt  Winter    13.6      16.5
9    Cairo   Egypt  Spring    20.7       6.5
10   Cairo   Egypt  Summer    27.7       0.1
11   Cairo   Egypt    Fall    22.2       4.5

In [68]:
cnn = sqlite3.connect('DataSet2Q8.db')

In [69]:
df.to_sql('Sea_data',cnn)

12

In [70]:
%load_ext sql

In [71]:
%sql sqlite:///DataSet2Q8.db

In [72]:
%%sql
SELECT * FROM Sea_data

 * sqlite:///DataSet2Q8.db
Done.

[(0, 'Mumbai', 'India', 'Winter', 24.8, 5.9),
 (1, 'Mumbai', 'India', 'Spring', 28.4, 16.2),
 (2, 'Mumbai', 'India', 'Summer', 27.9, 1549.4),
 (3, 'Mumbai', 'India', 'Fall', 27.6, 346.0),
 (4, 'London', 'Uk', 'Winter', 4.2, 207.7),
 (5, 'London', 'Uk', 'Spring', 8.3, 169.6),
 (6, 'London', 'Uk', 'Summer', 15.7, 157.0),
 (7, 'London', 'Uk', 'Fall', 10.4, 218.5),
 (8, 'Cairo', 'Egypt', 'Winter', 13.6, 16.5),
 (9, 'Cairo', 'Egypt', 'Spring', 20.7, 6.5),
 (10, 'Cairo', 'Egypt', 'Summer', 27.7, 0.1),
 (11, 'Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

###### a )All the temperature data

In [73]:
%%sql
SELECT Temp_c FROM Sea_data

 * sqlite:///DataSet2Q8.db
Done.

[(24.8,),
 (28.4,),
 (27.9,),
 (27.6,),
 (4.2,),
 (8.3,),
 (15.7,),
 (10.4,),
 (13.6,),
 (20.7,),
 (27.7,),
 (22.2,)]

#### b) All the cities, but without repetition.

In [78]:
%%sql
SELECT DISTINCT City FROM Sea_data

 * sqlite:///DataSet2Q8.db
Done.

[('Mumbai',), ('London',), ('Cairo',)]

#### c) All the records for India.

In [79]:
%%sql
SELECT * FROM Sea_data WHERE Country = "India"

 * sqlite:///DataSet2Q8.db
Done.

[(0, 'Mumbai', 'India', 'Winter', 24.8, 5.9),
 (1, 'Mumbai', 'India', 'Spring', 28.4, 16.2),
 (2, 'Mumbai', 'India', 'Summer', 27.9, 1549.4),
 (3, 'Mumbai', 'India', 'Fall', 27.6, 346.0)]

#### d) All the Fall records.

In [80]:
%%sql
SELECT * FROM Sea_data WHERE Season = "Fall"

 * sqlite:///DataSet2Q8.db
Done.

[(3, 'Mumbai', 'India', 'Fall', 27.6, 346.0),
 (7, 'London', 'Uk', 'Fall', 10.4, 218.5),
 (11, 'Cairo', 'Egypt', 'Fall', 22.2, 4.5)]

#### e) The city, country, and season for which the average rainfall is between 200 and 400 millimeters.

In [81]:
%%sql
SELECT City,Country,Season FROM Sea_data WHERE rainF_mm BETWEEN 200 AND 400

 * sqlite:///DataSet2Q8.db
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'Uk', 'Winter'),
 ('London', 'Uk', 'Fall')]

#### f) The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

In [83]:
%%sql
SELECT City,Country FROM Sea_data WHERE Season = "Fall" AND Temp_c<20.0

 * sqlite:///DataSet2Q8.db
Done.

[('London', 'Uk')]

#### g) The total annual rainfall for Cairo.

In [84]:
%%sql
SELECT SUM(rainF_mm) FROM Sea_data WHERE City = "Cairo"

 * sqlite:///DataSet2Q8.db
Done.

[(27.6,)]

#### h) The total rainfall for each season.

In [85]:
%%sql
SELECT SUM(rainF_mm) FROM Sea_data WHERE Season = "Winter"

 * sqlite:///DataSet2Q8.db
Done.

[(230.1,)]

In [86]:
%%sql
SELECT SUM(rainF_mm) FROM Sea_data WHERE Season = "Spring"

 * sqlite:///DataSet2Q8.db
Done.

[(192.29999999999998,)]

In [87]:
%%sql
SELECT SUM(rainF_mm) FROM Sea_data WHERE Season = "Summer"

 * sqlite:///DataSet2Q8.db
Done.

[(1706.5,)]

In [88]:
%%sql
SELECT SUM(rainF_mm) FROM Sea_data WHERE Season = "Fall"

 * sqlite:///DataSet2Q8.db
Done.

[(569.0,)]

# Que 9 :

In [2]:
words = ['The','quick','brown','fox','jumps','over','the','lazy','dog']

a.

In [3]:
uppW = [word.upper() for word in words]
print(uppW)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

b.

In [4]:
lowW = [word.lower() for word in words]
print(lowW)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

c.

In [5]:
lengW = [len(word) for word in words]
print(lengW)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

D.

In [6]:
mixW= [(word.upper(),word.lower(),len(word)) for word in words]
print(mixW)

[('THE', 'the', 3), ('QUICK', 'quick', 5), ('BROWN', 'brown', 5), ('FOX', 'fox', 3), ('JUMPS', 'jumps', 5), ('OVER', 'over', 4), ('THE', 'the', 3), ('LAZY', 'lazy', 4), ('DOG', 'dog', 3)]

E.

In [7]:
greW4 = [word for word in words if len(word)>= 4]
print(greW4)

['quick', 'brown', 'jumps', 'over', 'lazy']